<a href="https://colab.research.google.com/github/vorotnikov-nikita/PrPrPr/blob/main/Praktica.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

In [6]:
data = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head (3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [7]:
names = ["Id","RI","Na","Mg","Al","Si","K","Ca","Ba","Fe","Class"]
data.columns = names
data = data.drop(columns=["Id"])
data.head (3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [13]:
data['Class'].replace (
                         {
                            1: "building_windows_float_processed",
                            2: "building_windows_non_float_processed",
                            3: "vehicle_windows_float_processed",
                            4: "vehicle_windows_non_float_processed",
                            5: "containers",
                            6: "tableware",
                            7: "headlamps"
                               }, inplace = True)
data.head (7)

        RI     Na    Mg  ...   Ba    Fe                             Class
0  1.52101  13.64  4.49  ...  0.0  0.00  building_windows_float_processed
1  1.51761  13.89  3.60  ...  0.0  0.00  building_windows_float_processed
2  1.51618  13.53  3.55  ...  0.0  0.00  building_windows_float_processed
3  1.51766  13.21  3.69  ...  0.0  0.00  building_windows_float_processed
4  1.51742  13.27  3.62  ...  0.0  0.00  building_windows_float_processed
5  1.51596  12.79  3.61  ...  0.0  0.26  building_windows_float_processed
6  1.51743  13.30  3.60  ...  0.0  0.00  building_windows_float_processed

[7 rows x 10 columns]

In [14]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      201 non-null    float64
 1   Na      195 non-null    float64
 2   Mg      201 non-null    float64
 3   Al      201 non-null    float64
 4   Si      203 non-null    float64
 5   K       195 non-null    float64
 6   Ca      197 non-null    float64
 7   Ba      195 non-null    float64
 8   Fe      203 non-null    float64
 9   Class   199 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB